Конфигурация/Documents/Нарушение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Нарушение</Name>
			<BasedOn>
				<xr:Item>Document.ВходящийДокумент</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСовершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыявления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Классификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторНарушений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативноПравойАкт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛицензииУКПИФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛицензииДУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящийДокумент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Устранимо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокУстранения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Активы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодАктива</Name>
							<Comment>Специальный составной код классификатора. Указывается вручную</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Актив</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.АктивыСтраховыхКомпаний</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/Нарушение/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.Устранимо И ЭтаФорма.ЗаданСрокУстранения И Не ЗначениеЗаполнено(Объект.СрокУстранения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле 'Срок устранения' не заполнено",,, "Объект.СрокУстранения", Отказ); 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Объект.Устранимо Или Не ЭтаФорма.ЗаданСрокУстранения Тогда
		ТекущийОбъект.СрокУстранения = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура УстранимоПриИзменении(Элемент)
	
	УстановитьВидимостьРеквизитовУстраненияНарушения(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаданСрокУстраненияПриИзменении(Элемент)
	
	Элементы.СрокУстранения.АвтоОтметкаНезаполненного = ЭтаФорма.ЗаданСрокУстранения;
	УстановитьВидимостьРеквизитовУстраненияНарушения(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ОпределитьИсходящийДокументНаСервере();	
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ЭтаФорма.ЗаданСрокУстранения = (Объект.Устранимо И ЗначениеЗаполнено(Объект.СрокУстранения));
	КонецЕсли; 
	
	УстановитьВидимостьРеквизитовУстраненияНарушения(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьИсходящийДокументНаСервере()
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсходящийДокумент.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИсходящийДокумент КАК ИсходящийДокумент
		|ГДЕ
		|	ИсходящийДокумент.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	
	ИсходящиеДокументы = Запрос.Выполнить().Выбрать();
	
	Если ИсходящиеДокументы.Следующий() Тогда
		 
		//ЗначениеВРеквизитФормы(ИсходящиеДокументы.Ссылка, "УведомлениеОНарушении");
		УведомлениеОНарушении =  ИсходящиеДокументы.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьРеквизитовУстраненияНарушения(ЭтаФорма)

	ЭтаФорма.Элементы.ЗаданСрокУстранения.Видимость = ЭтаФорма.Объект.Устранимо;
	ЭтаФорма.Элементы.СрокУстранения.Видимость = (ЭтаФорма.Объект.Устранимо И ЭтаФорма.ЗаданСрокУстранения);

КонецПроцедуры

#КонецОбласти
